{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "batch_input_shape": [null, 400, 200, 1], "trainable": true, "name": "zeropadding2d_1", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "border_mode": "valid", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 10, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "border_mode": "valid", "activation": "relu", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 10, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "zeropadding2d_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "tf", "subsample": [1, 1], "init": "normal", "bias": true, "nb_filter": 1, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}}]}